Reports/ИсторияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Report>
		<Properties>
			<Name>ИсторияОС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/МестонахождениеОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>МестонахождениеОСБухгалтерскийУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Выбирается из списка регистра сведений "Работники организаций"</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестонахождениеОСДляГНИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестоНахождениеОбъекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НачислениеАмортизацииОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>НачислениеАмортизацииОСБухгалтерскийУчет</Name>
			<Comment>(Регл) Регистр, который показывает когда начислять амортизацию по бух. учету</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачислятьАмортизацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПараметрыАмортизацииОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыАмортизацииОСБухгалтерскийУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтоимостьДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорректирующийКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрВыработкиОС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыВыработкиОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПервоначальныеСведенияОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ПервоначальныеСведенияОСБухгалтерскийУчет</Name>
			<Comment>(Регл) Регистр, который показывает изменение инвентарного номера ОС при передаче его из одной организации в другую. Информация записывается только документами ПринятиеКУчету по бух. виду учета и ввод остатков</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособПоступления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПоступленияАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокПогашенияСтоимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокПогашенияСтоимостиОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеГруппыОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПротивопожарныеОС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыОборудования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОСПоОхранеОкружающейСреды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаОС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетаБухгалтерскогоУчетаОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СчетаБухгалтерскогоУчетаОС</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет</Name>
			<Comment>(Регл) Регистр, который показывает изменение направлений амортизации по бух. учету</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособыОтраженияРасходовПоАмортизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовПоАмортизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШифрПроизводственныхЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШифрыПроизводственныхЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ИсторияОС/Ext/ObjectModule.bsl
Процедура Отчет(ТабДок) Экспорт
	
	Макет = ПолучитьМакет("Отчет");
	
	тз=новый ТаблицаЗначений;
	тз.Колонки.Добавить("Период");
	тз.Колонки.Добавить("Регистратор");
	тз.Колонки.Добавить("Местонахождение");
	тз.Колонки.Добавить("МОЛ");
	тз.Колонки.Добавить("КоэффициентАмортизации");
	тз.Колонки.Добавить("НачислятьАмортизацию");
	тз.Колонки.Добавить("ПроизводственнаяГруппа");
	тз.Колонки.Добавить("ПротивопожарныеОС");
	тз.Колонки.Добавить("ОСПоОхранеОкружающейСреды");
	тз.Колонки.Добавить("СпособыОтраженияРасходовПоАмортизации");
	тз.Колонки.Добавить("СчетУчета");
	тз.Колонки.Добавить("СчетНачисленияАмортизации");
	
	Запрос=новый Запрос;
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство",ОсновноеСредство);
	//==============================
	Запрос.Текст=
	"ВЫБРАТЬ
	|	МестонахождениеОСБухгалтерскийУчет.Период,
	|	МестонахождениеОСБухгалтерскийУчет.Регистратор,
	|	МестонахождениеОСБухгалтерскийУчет.МОЛ,
	|	МестонахождениеОСБухгалтерскийУчет.Местонахождение
	|ИЗ
	|	РегистрСведений.МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОСБухгалтерскийУчет
	|ГДЕ
	|	МестонахождениеОСБухгалтерскийУчет.ОсновноеСредство = &ОсновноеСредство
	|	И МестонахождениеОСБухгалтерскийУчет.Организация = &Организация";
	
	РезультатЗапроса=Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка из  РезультатЗапроса Цикл
		СтрокаТз=тз.Найти(Строка.Регистратор);
		
		Если СтрокаТз=Неопределено Тогда
			СтрокаТз=тз.Добавить();
			СтрокаТз.Период=Строка.Период;
			СтрокаТз.Регистратор=Строка.Регистратор;
		КонецЕсли;	
		
		СтрокаТз.МОЛ=Строка.МОЛ;
		СтрокаТз.Местонахождение=Строка.Местонахождение;
		
	КонецЦикла;	
	//==============================
	Запрос.Текст=
	"ВЫБРАТЬ
	|	НачислениеАмортизацииОСБухгалтерскийУчет.Период,
	|	НачислениеАмортизацииОСБухгалтерскийУчет.Регистратор,
	|	НачислениеАмортизацииОСБухгалтерскийУчет.НачислятьАмортизацию
	|ИЗ
	|	РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет КАК НачислениеАмортизацииОСБухгалтерскийУчет
	|ГДЕ
	|	НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство = &ОсновноеСредство
	|	И НачислениеАмортизацииОСБухгалтерскийУчет.Организация = &Организация";
	
	РезультатЗапроса=Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка из  РезультатЗапроса Цикл
		СтрокаТз=тз.Найти(Строка.Регистратор);
		Если СтрокаТз=Неопределено Тогда
			СтрокаТз=тз.Добавить();
			СтрокаТз.Период=Строка.Период;
			СтрокаТз.Регистратор=Строка.Регистратор;
		КонецЕсли;	
		СтрокаТз.НачислятьАмортизацию=Строка.НачислятьАмортизацию;
	КонецЦикла;	
	//==============================
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ПараметрыАмортизацииОСБухгалтерскийУчет.Период,
	|	ПараметрыАмортизацииОСБухгалтерскийУчет.Регистратор,
	|	ПараметрыАмортизацииОСБухгалтерскийУчет.СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОСБухгалтерскийУчет.КоэффициентАмортизации
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет КАК ПараметрыАмортизацииОСБухгалтерскийУчет
	|ГДЕ
	|	ПараметрыАмортизацииОСБухгалтерскийУчет.ОсновноеСредство = &ОсновноеСредство
	|	И ПараметрыАмортизацииОСБухгалтерскийУчет.Организация = &Организация";
	
	РезультатЗапроса=Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка из  РезультатЗапроса Цикл
		СтрокаТз=тз.Найти(Строка.Регистратор);
		Если СтрокаТз=Неопределено Тогда
			СтрокаТз=тз.Добавить();
			СтрокаТз.Период=Строка.Период;
			СтрокаТз.Регистратор=Строка.Регистратор;
		КонецЕсли;	
		СтрокаТз.КоэффициентАмортизации=Строка.КоэффициентАмортизации;
	КонецЦикла;	
	//==============================
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.Период,
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.Регистратор,
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.СпособПоступления,
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.СпособНачисленияАмортизации,
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.ПроизводственнаяГруппа,
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.ПротивопожарныеОС,
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.ОСПоОхранеОкружающейСреды,
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.Состояние
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет КАК ПервоначальныеСведенияОСБухгалтерскийУчет
	|ГДЕ
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.ОсновноеСредство = &ОсновноеСредство
	|	И ПервоначальныеСведенияОСБухгалтерскийУчет.Организация = &Организация";
	
	РезультатЗапроса=Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка из  РезультатЗапроса Цикл
		СтрокаТз=тз.Найти(Строка.Регистратор);
		Если СтрокаТз=Неопределено Тогда
			СтрокаТз=тз.Добавить();
			СтрокаТз.Период=Строка.Период;
			СтрокаТз.Регистратор=Строка.Регистратор;
		КонецЕсли;	
		СтрокаТз.ПроизводственнаяГруппа=Строка.ПроизводственнаяГруппа;
		СтрокаТз.ПротивопожарныеОС=Строка.ПротивопожарныеОС;
		СтрокаТз.ОСПоОхранеОкружающейСреды=Строка.ОСПоОхранеОкружающейСреды;
	КонецЦикла;	
	//==============================
	Запрос.Текст=
	"ВЫБРАТЬ
	|	СчетаБухгалтерскогоУчетаОС.Период,
	|	СчетаБухгалтерскогоУчетаОС.Регистратор,
	|	СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации,
	|	СчетаБухгалтерскогоУчетаОС.СчетУчета
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаБухгалтерскогоУчетаОС
	|ГДЕ
	|	СчетаБухгалтерскогоУчетаОС.ОсновноеСредство = &ОсновноеСредство
	|	И СчетаБухгалтерскогоУчетаОС.Организация = &Организация";
	
	РезультатЗапроса=Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка из  РезультатЗапроса Цикл
		СтрокаТз=тз.Найти(Строка.Регистратор);
		Если СтрокаТз=Неопределено Тогда
			СтрокаТз=тз.Добавить();
			СтрокаТз.Период=Строка.Период;
			СтрокаТз.Регистратор=Строка.Регистратор;
		КонецЕсли;	
		СтрокаТз.СчетНачисленияАмортизации=Строка.СчетНачисленияАмортизации;
		СтрокаТз.СчетУчета=Строка.СчетУчета;
	КонецЦикла;	
	//==============================
	Запрос.Текст=
	"ВЫБРАТЬ
	|	СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Период,
	|	СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Регистратор,
	|	СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СпособыОтраженияРасходовПоАмортизации
	|ИЗ
	|	РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет КАК СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет
	|ГДЕ
	|	СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.ОсновноеСредство = &ОсновноеСредство
	|	И СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Организация = &Организация";
	
	РезультатЗапроса=Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка из  РезультатЗапроса Цикл
		СтрокаТз=тз.Найти(Строка.Регистратор);
		Если СтрокаТз=Неопределено Тогда
			СтрокаТз=тз.Добавить();
			СтрокаТз.Период=Строка.Период;
			СтрокаТз.Регистратор=Строка.Регистратор;
		КонецЕсли;	
		СтрокаТз.СпособыОтраженияРасходовПоАмортизации=Строка.СпособыОтраженияРасходовПоАмортизации;
	КонецЦикла;	
	
	тз.сортировать("Период,Регистратор");
	
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьДетали = Макет.ПолучитьОбласть("Детали");

	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();

	Для Каждого СтрокаТз из тз Цикл
		ОбластьДетали.Параметры.Заполнить(СтрокаТз);
		ТабДок.Вывести(ОбластьДетали);
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	
КонецПроцедуры
